package section01.conditional;

public class C_ifElseIf {
    /* 수업목표. if-else-if문 단독 사용에 대한 흐름을 이해하고 적용할 수 있다. */
    /* 필기.
     *  [if-else-if문 표현식]
     *  if(조건식 #1) {
     *      조건식 #1이 true일 때 실행할 명령문;
     *  } else if(조건식 #2) {
     *      조건식 #1이 false이고, 조건식# 2가 true일 때 실행할 명령문;
     *  } else {
     *      위의 조건 2개가 모두 거짓인 경우 실핼할 명령문;
     *  }
     * */

    /* 필기.
     *  if-else-if문은 조건식1의 결과 값이 참(true)이면 if { } 안에 있는 코드를 실행하고,
     *  조건식1이 false이면 조건식2를 확인하여 참(true)이면 else if { } 안에 있는 코드를 실행한다.
     *  조건식1, 2의 결과 값이 모두 거짓(false)이면  else { } 안에 있는 코드를 실행한다.
     * */

    /* 설명.여러 개의 조건을 제시하여 그 중 한 가지를 반드시 실행시키고 싶은 경우 사용한다. */

    /* 설명.
     *  금도끼 은도끼 동화에서 산신령이 어떤 도끼가 나무꾼의 도끼인지를 물어보는 시나리오대로
     *  코드를 작성하고 실행하보자!
     * */
}
